//  حساب المتوسط الحسابي

// احسب المتوسط الحسابي لعدد الطلبات اليومية.

let sum_talabat = 140
let numOfDays = 7
let mean;

mean = sum_talabat / numOfDays;
// mean = 20

//  حساب الوسيط

// رتّب أعداد الطلبات من الأصغر إلى الأكبر، ثم حدد القيمة التي تقع في المنتصف.

// البيانات بعد الترتيب:
const arr = [40, 18, 20, 20, 20, 22 ,25 ]  


let median = 20

//  حساب المنوال

// ابحث عن القيمة الأكثر تكرارًا في البيانات.

let Mode = 20

// تفسير النتائج

// بعد حساب المتوسط والوسيط والمنوال، أجب عن الأسئلة الآتية:

// افترض أن المتجر أطلق حملة تسويقية جديدة، وأصبح عدد الطلبات يوم السبت 40 طلبًا بدلًا من 15.


mean =  23.57
median = 20
Mode = 20
